/* automatically generated by rust-bindgen 0.59.1 */

pub const ARCH_FEATURES_ALL: i32 = -1;
pub const DECODE_STATUS_OK: u32 = 0;
pub const DECODE_STATUS_RESERVED: i32 = -1;
pub const DECODE_STATUS_UNMATCHED: i32 = -2;
pub const DECODE_STATUS_UNALLOCATED: i32 = -3;
pub const DECODE_STATUS_UNDEFINED: i32 = -4;
pub const DECODE_STATUS_END_OF_INSTRUCTION: i32 = -5;
pub const DECODE_STATUS_LOST: i32 = -6;
pub const DECODE_STATUS_UNREACHABLE: i32 = -7;
pub const DECODE_STATUS_ASSERT_FAILED: i32 = -8;
pub const DECODE_STATUS_ERROR_OPERANDS: i32 = -9;
pub const MAX_REGISTERS: u32 = 5;
pub const MAX_NAME: u32 = 16;
pub const MAX_OPERANDS: u32 = 5;
pub const Operation_ARM64_ERROR: Operation = 0;
pub const Operation_ARM64_ABS: Operation = 1;
pub const Operation_ARM64_ADC: Operation = 2;
pub const Operation_ARM64_ADCLB: Operation = 3;
pub const Operation_ARM64_ADCLT: Operation = 4;
pub const Operation_ARM64_ADCS: Operation = 5;
pub const Operation_ARM64_ADD: Operation = 6;
pub const Operation_ARM64_ADDG: Operation = 7;
pub const Operation_ARM64_ADDHN: Operation = 8;
pub const Operation_ARM64_ADDHN2: Operation = 9;
pub const Operation_ARM64_ADDHNB: Operation = 10;
pub const Operation_ARM64_ADDHNT: Operation = 11;
pub const Operation_ARM64_ADDP: Operation = 12;
pub const Operation_ARM64_ADDPL: Operation = 13;
pub const Operation_ARM64_ADDS: Operation = 14;
pub const Operation_ARM64_ADDV: Operation = 15;
pub const Operation_ARM64_ADDVL: Operation = 16;

    pub need_secure: u64,
    pub neg: u64,
    pub neg_i: u64,
    pub neg_r: u64,
    pub negated: u64,
    pub nreg: u64,
    pub nzcv: u64,
    pub nXS: u64,
    pub o0: u64,
    pub o1: u64,
    pub o2: u64,
    pub o3: u64,
    pub offs_size: u64,
    pub offs_unsigned: u64,
    pub offset: u64,
    pub op1_neg: u64,
    pub op1_unsigned: u64,
    pub op: u64,
    pub op0: u64,
    pub op1: u64,
    pub op2: u64,
    pub op3: u64,
    pub op4: u64,
    pub op21: u64,
    pub op31: u64,
    pub op54: u64,
    pub op2_unsigned: u64,
    pub op3_neg: u64,
    pub opa_neg: u64,
    pub opc: u64,
    pub opc2: u64,
    pub opcode: u64,
    pub opcode2: u64,
    pub operand: u64,
    pub operation_: u64,
    pub opt: u64,
    pub option: u64,
    pub osize: u64,
    pub pac: u64,
    pub page: u64,
    pub pair: u64,
    pub pairs: u64,
    pub part: u64,
    pub part1: u64,
    pub pat: u64,
    pub pattern: u64,
    pub poly: u64,
    pub pos: u64,
    pub position: u64,
    pub postindex: u64,
    pub pref_hint: u64,
    pub prfop: u64,
    pub ptype: u64,
    pub rd: u64,
    pub read: u64,
    pub regs: u64,
    pub regsize: u64,
    pub replicate: u64,
    pub rmode: u64,
    pub rot: u64,
    pub round: u64,
    pub rounding: u64,
    pub rpt: u64,
    pub rsize: u64,
    pub rn_unknown: u64,
    pub rt_unknown: u64,
    pub rw: u64,
    pub s: u64,
    pub s_esize: u64,
    pub saturating: u64,
    pub scale: u64,
    pub sel: u64,
    pub sel_a: u64,
    pub sel_b: u64,
    pub selem: u64,
    pub setflags: u64,
    pub sf: u64,
    pub sh: u64,
    pub shift: u64,
    pub shift_amount: u64,
    pub shift_type: u64,
    pub signal_all_nans: u64,
    pub signed_: u64,
    pub simm7: u64,
    pub size: u64,
    pub source_is_sp: u64,
    pub src_index: u64,
    pub src_unsigned: u64,
    pub srcsize: u64,
    pub ssize: u64,
    pub ssz: u64,
    pub stacctype: u64,
    pub stream: u64,
    pub sub_i: u64,
    pub sub_op: u64,
    pub sub_r: u64,
    pub swsize: u64,
    pub sys_crm: u64,
    pub sys_crn: u64,
    pub sys_op0: u64,
    pub sys_op1: u64,
    pub sys_op2: u64,
    pub sz: u64,
    pub t: u64,
    pub t2: u64,
    pub tb: u64,
    pub tag_checked: u64,
    pub tag_offset: u64,
    pub target_level: u64,
    pub tmask: u64,
    pub tsize: u64,
    pub tsz: u64,
    pub tszh: u64,
    pub tszl: u64,
    pub types: u64,
    pub uimm4: u64,
    pub uimm6: u64,
    pub unpriv_at_el1: u64,
    pub unpriv_at_el2: u64,
    pub uns: u64,
    pub unsigned_: u64,
    pub use_key_a: u64,
    pub user_access_override: u64,
    pub wback: u64,
    pub wb_unknown: u64,
    pub wmask: u64,
    pub writeback: u64,
    pub xs: u64,
    pub Zk: u64,
    pub zero_data: u64,
}
#[test]
fn bindgen_test_layout_context_() {
    assert_eq!(
        ::core::mem::size_of::<context_>(),
        3008usize,
        concat!("Size of: ", stringify!(context_))
    );
    assert_eq!(
        ::core::mem::align_of::<context_>(),
        8usize,
        concat!("Alignment of ", stringify!(context_))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).insword as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(insword)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).address as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(address)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).features0 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(features0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).features1 as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(features1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).pstate_btype as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(pstate_btype)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).pstate_el as *const _ as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(pstate_el)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).pstate_uao as *const _ as usize },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(pstate_uao)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).BTypeCompatible as *const _ as usize },
        35usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(BTypeCompatible)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).BTypeNext as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(BTypeNext)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).halted as *const _ as usize },
        37usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(halted)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).FPCR as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(FPCR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).EDSCR_HDE as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(EDSCR_HDE)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).A as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(A)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).ADD as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(ADD)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).AccType_NORMAL as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(AccType_NORMAL)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).AccType_STREAM as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(AccType_STREAM)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).AccType_UNPRIV as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(AccType_UNPRIV)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).AccType_VEC as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(AccType_VEC)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).AccType_VECSTREAM as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(AccType_VECSTREAM)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).B as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(B)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).C as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(C)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).CRm as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(CRm)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).CRn as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(CRn)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).dst as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(dst)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).D as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(D)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).E as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(E)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).H as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(H)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).HCR_EL2_E2H as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(HCR_EL2_E2H)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).HCR_EL2_NV as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(HCR_EL2_NV)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).HCR_EL2_NV1 as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(HCR_EL2_NV1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).HCR_EL2_TGE as *const _ as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(HCR_EL2_TGE)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).k as *const _ as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(k)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).L as *const _ as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(L)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).LL as *const _ as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(LL)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).M as *const _ as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(M)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).N as *const _ as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(N)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).O as *const _ as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(O)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Op0 as *const _ as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Op0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Op3 as *const _ as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Op3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).P as *const _ as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(P)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Pd as *const _ as usize },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Pd)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Pdm as *const _ as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Pdm)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Pdn as *const _ as usize },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Pdn)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Pg as *const _ as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Pg)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Pm as *const _ as usize },
        312usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Pm)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Pn as *const _ as usize },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Pn)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Pt as *const _ as usize },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Pt)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Q as *const _ as usize },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Q)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Qa as *const _ as usize },
        344usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Qa)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Qd as *const _ as usize },
        352usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Qd)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Qm as *const _ as usize },
        360usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Qm)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Qn as *const _ as usize },
        368usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Qn)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Qt as *const _ as usize },
        376usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Qt)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Qt2 as *const _ as usize },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Qt2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).reason as *const _ as usize },
        392usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(reason)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).retry as *const _ as usize },
        400usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(retry)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).R as *const _ as usize },
        408usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(R)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Ra as *const _ as usize },
        416usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Ra)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Rd as *const _ as usize },
        424usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Rd)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Rdn as *const _ as usize },
        432usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Rdn)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Rm as *const _ as usize },
        440usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Rm)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Rmhi as *const _ as usize },
        448usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Rmhi)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Rn as *const _ as usize },
        456usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Rn)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Rs as *const _ as usize },
        464usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Rs)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Rt as *const _ as usize },
        472usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Rt)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Rt2 as *const _ as usize },
        480usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Rt2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).s1 as *const _ as usize },
        488usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(s1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).s2 as *const _ as usize },
        496usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(s2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).sel1 as *const _ as usize },
        504usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(sel1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).sel2 as *const _ as usize },
        512usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(sel2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).S as *const _ as usize },
        520usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(S)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Sa as *const _ as usize },
        528usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Sa)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Sd as *const _ as usize },
        536usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Sd)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Sm as *const _ as usize },
        544usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Sm)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Sn as *const _ as usize },
        552usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Sn)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).St as *const _ as usize },
        560usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(St)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).St2 as *const _ as usize },
        568usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(St2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).S10 as *const _ as usize },
        576usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(S10)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).SCTLR_EL1_UMA as *const _ as usize },
        584usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(SCTLR_EL1_UMA)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).T as *const _ as usize },
        592usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(T)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).U as *const _ as usize },
        600usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(U)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).US as *const _ as usize },
        608usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(US)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).V as *const _ as usize },
        616usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(V)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Va as *const _ as usize },
        624usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Va)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Vd as *const _ as usize },
        632usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Vd)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Vdn as *const _ as usize },
        640usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Vdn)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Vm as *const _ as usize },
        648usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Vm)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Vn as *const _ as usize },
        656usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Vn)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Vt as *const _ as usize },
        664usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Vt)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Vt2 as *const _ as usize },
        672usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Vt2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).W as *const _ as usize },
        680usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(W)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Wa as *const _ as usize },
        688usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Wa)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Wd as *const _ as usize },
        696usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Wd)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Wdn as *const _ as usize },
        704usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Wdn)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Wm as *const _ as usize },
        712usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Wm)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Wn as *const _ as usize },
        720usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Wn)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Ws as *const _ as usize },
        728usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Ws)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Wt as *const _ as usize },
        736usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Wt)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Wt2 as *const _ as usize },
        744usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Wt2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Xa as *const _ as usize },
        752usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Xa)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Xd as *const _ as usize },
        760usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Xd)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Xdn as *const _ as usize },
        768usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Xdn)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Xm as *const _ as usize },
        776usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Xm)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Xn as *const _ as usize },
        784usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Xn)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Xs as *const _ as usize },
        792usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Xs)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Xt as *const _ as usize },
        800usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Xt)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Xt2 as *const _ as usize },
        808usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Xt2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Z as *const _ as usize },
        816usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Z)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Za as *const _ as usize },
        824usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Za)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Zd as *const _ as usize },
        832usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Zd)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Zda as *const _ as usize },
        840usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Zda)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Zdn as *const _ as usize },
        848usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Zdn)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Zm as *const _ as usize },
        856usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Zm)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Zn as *const _ as usize },
        864usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Zn)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Zt as *const _ as usize },
        872usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Zt)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).a as *const _ as usize },
        880usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(a)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).abs as *const _ as usize },
        888usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(abs)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).ac as *const _ as usize },
        896usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(ac)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).acc as *const _ as usize },
        904usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(acc)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).acctype as *const _ as usize },
        912usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(acctype)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).accumulate as *const _ as usize },
        920usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(accumulate)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).amount as *const _ as usize },
        928usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(amount)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).and_test as *const _ as usize },
        936usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(and_test)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).asimdimm as *const _ as usize },
        944usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(asimdimm)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).b as *const _ as usize },
        952usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(b)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).b40 as *const _ as usize },
        960usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(b40)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).b5 as *const _ as usize },
        968usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(b5)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).bit_pos as *const _ as usize },
        976usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(bit_pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).bit_val as *const _ as usize },
        984usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(bit_val)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).branch_type as *const _ as usize },
        992usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(branch_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).c as *const _ as usize },
        1000usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(c)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).cmode as *const _ as usize },
        1008usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(cmode)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).cmp as *const _ as usize },
        1016usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(cmp)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).cmph as *const _ as usize },
        1024usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(cmph)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).cmpl as *const _ as usize },
        1032usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(cmpl)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).cmp_eq as *const _ as usize },
        1040usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(cmp_eq)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).cmp_with_zero as *const _ as usize },
        1048usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(cmp_with_zero)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).comment as *const _ as usize },
        1056usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(comment)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).comparison as *const _ as usize },
        1064usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(comparison)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).cond as *const _ as usize },
        1072usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(cond)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).condition as *const _ as usize },
        1080usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(condition)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).container_size as *const _ as usize },
        1088usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(container_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).containers as *const _ as usize },
        1096usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(containers)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).countop as *const _ as usize },
        1104usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(countop)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).crc32c as *const _ as usize },
        1112usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(crc32c)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).csize as *const _ as usize },
        1120usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(csize)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).d as *const _ as usize },
        1128usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(d)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).da as *const _ as usize },
        1136usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(da)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).data as *const _ as usize },
        1144usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).datasize as *const _ as usize },
        1152usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(datasize)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).double_table as *const _ as usize },
        1160usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(double_table)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).dtype as *const _ as usize },
        1168usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(dtype)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).dtypeh as *const _ as usize },
        1176usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(dtypeh)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).dtypel as *const _ as usize },
        1184usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(dtypel)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).d_esize as *const _ as usize },
        1192usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(d_esize)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).decrypt as *const _ as usize },
        1200usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(decrypt)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).destsize as *const _ as usize },
        1208usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(destsize)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).dm as *const _ as usize },
        1216usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(dm)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).dn as *const _ as usize },
        1224usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(dn)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).domain as *const _ as usize },
        1232usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(domain)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).dst_index as *const _ as usize },
        1240usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(dst_index)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).dst_unsigned as *const _ as usize },
        1248usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(dst_unsigned)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).dstsize as *const _ as usize },
        1256usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(dstsize)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).e as *const _ as usize },
        1264usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(e)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).elements as *const _ as usize },
        1272usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(elements)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<context_>())).elements_per_container as *const _ as usize
        },
        1280usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(elements_per_container)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).else_inc as *const _ as usize },
        1288usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(else_inc)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).else_inv as *const _ as usize },
        1296usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(else_inv)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).elsize as *const _ as usize },
        1304usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(elsize)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).eq as *const _ as usize },
        1312usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(eq)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).esize as *const _ as usize },
        1320usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(esize)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).exact as *const _ as usize },
        1328usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(exact)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).extend as *const _ as usize },
        1336usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(extend)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).extend_type as *const _ as usize },
        1344usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(extend_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).f as *const _ as usize },
        1352usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(f)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).ff as *const _ as usize },
        1360usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(ff)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).field as *const _ as usize },
        1368usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(field)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).flags as *const _ as usize },
        1376usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).fltsize as *const _ as usize },
        1384usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(fltsize)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).fpop as *const _ as usize },
        1392usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(fpop)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).fracbits as *const _ as usize },
        1400usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(fracbits)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).ftype as *const _ as usize },
        1408usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(ftype)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).g as *const _ as usize },
        1416usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(g)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).h as *const _ as usize },
        1424usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(h)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).has_result as *const _ as usize },
        1432usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(has_result)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).hi as *const _ as usize },
        1440usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(hi)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).hw as *const _ as usize },
        1448usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(hw)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).i as *const _ as usize },
        1456usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(i)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).i1 as *const _ as usize },
        1464usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(i1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).i2 as *const _ as usize },
        1472usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(i2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).i2h as *const _ as usize },
        1480usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(i2h)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).i2l as *const _ as usize },
        1488usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(i2l)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).i3h as *const _ as usize },
        1496usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(i3h)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).i3l as *const _ as usize },
        1504usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(i3l)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).idxdsize as *const _ as usize },
        1512usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(idxdsize)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).imm as *const _ as usize },
        1520usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(imm)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).imm1 as *const _ as usize },
        1528usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(imm1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).imm12 as *const _ as usize },
        1536usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(imm12)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).imm13 as *const _ as usize },
        1544usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(imm13)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).imm14 as *const _ as usize },
        1552usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(imm14)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).imm16 as *const _ as usize },
        1560usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(imm16)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).imm19 as *const _ as usize },
        1568usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(imm19)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).imm2 as *const _ as usize },
        1576usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(imm2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).imm26 as *const _ as usize },
        1584usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(imm26)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).imm3 as *const _ as usize },
        1592usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(imm3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).imm4 as *const _ as usize },
        1600usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(imm4)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).imm5 as *const _ as usize },
        1608usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(imm5)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).imm5b as *const _ as usize },
        1616usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(imm5b)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).imm6 as *const _ as usize },
        1624usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(imm6)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).imm64 as *const _ as usize },
        1632usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(imm64)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).imm7 as *const _ as usize },
        1640usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(imm7)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).imm8 as *const _ as usize },
        1648usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(imm8)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).imm8h as *const _ as usize },
        1656usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(imm8h)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).imm8l as *const _ as usize },
        1664usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(imm8l)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).imm9 as *const _ as usize },
        1672usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(imm9)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).imm9h as *const _ as usize },
        1680usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(imm9h)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).imm9l as *const _ as usize },
        1688usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(imm9l)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).immb as *const _ as usize },
        1696usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(immb)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).immh as *const _ as usize },
        1704usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(immh)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).immhi as *const _ as usize },
        1712usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(immhi)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).immlo as *const _ as usize },
        1720usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(immlo)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).immr as *const _ as usize },
        1728usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(immr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).imms as *const _ as usize },
        1736usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(imms)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).index as *const _ as usize },
        1744usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(index)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).init_scale as *const _ as usize },
        1752usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(init_scale)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).intsize as *const _ as usize },
        1760usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(intsize)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).int_U as *const _ as usize },
        1768usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(int_U)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).invert as *const _ as usize },
        1776usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(invert)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).inzero as *const _ as usize },
        1784usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(inzero)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).isBefore as *const _ as usize },
        1792usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(isBefore)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).is_tbl as *const _ as usize },
        1800usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(is_tbl)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).iszero as *const _ as usize },
        1808usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(iszero)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).ldacctype as *const _ as usize },
        1816usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(ldacctype)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).len as *const _ as usize },
        1824usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).level as *const _ as usize },
        1832usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(level)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).lsb as *const _ as usize },
        1840usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(lsb)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).lt as *const _ as usize },
        1848usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(lt)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).m as *const _ as usize },
        1856usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(m)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).mask as *const _ as usize },
        1864usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(mask)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).mbytes as *const _ as usize },
        1872usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(mbytes)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).memop as *const _ as usize },
        1880usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(memop)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).merging as *const _ as usize },
        1888usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(merging)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).min as *const _ as usize },
        1896usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(min)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).min_EL as *const _ as usize },
        1904usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(min_EL)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).minimum as *const _ as usize },
        1912usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(minimum)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).msb as *const _ as usize },
        1920usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(msb)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).msize as *const _ as usize },
        1928usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(msize)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).msz as *const _ as usize },
        1936usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(msz)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).mulx_op as *const _ as usize },
        1944usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(mulx_op)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).n as *const _ as usize },
        1952usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(n)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).ne as *const _ as usize },
        1960usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(ne)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).need_secure as *const _ as usize },
        1968usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(need_secure)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).neg as *const _ as usize },
        1976usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(neg)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).neg_i as *const _ as usize },
        1984usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(neg_i)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).neg_r as *const _ as usize },
        1992usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(neg_r)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).negated as *const _ as usize },
        2000usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(negated)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).nreg as *const _ as usize },
        2008usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(nreg)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).nzcv as *const _ as usize },
        2016usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(nzcv)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).nXS as *const _ as usize },
        2024usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(nXS)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).o0 as *const _ as usize },
        2032usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(o0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).o1 as *const _ as usize },
        2040usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(o1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).o2 as *const _ as usize },
        2048usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(o2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).o3 as *const _ as usize },
        2056usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(o3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).offs_size as *const _ as usize },
        2064usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(offs_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).offs_unsigned as *const _ as usize },
        2072usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(offs_unsigned)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).offset as *const _ as usize },
        2080usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).op1_neg as *const _ as usize },
        2088usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(op1_neg)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).op1_unsigned as *const _ as usize },
        2096usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(op1_unsigned)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).op as *const _ as usize },
        2104usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(op)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).op0 as *const _ as usize },
        2112usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(op0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).op1 as *const _ as usize },
        2120usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(op1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).op2 as *const _ as usize },
        2128usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(op2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).op3 as *const _ as usize },
        2136usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(op3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).op4 as *const _ as usize },
        2144usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(op4)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).op21 as *const _ as usize },
        2152usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(op21)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).op31 as *const _ as usize },
        2160usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(op31)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).op54 as *const _ as usize },
        2168usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(op54)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).op2_unsigned as *const _ as usize },
        2176usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(op2_unsigned)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).op3_neg as *const _ as usize },
        2184usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(op3_neg)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).opa_neg as *const _ as usize },
        2192usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(opa_neg)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).opc as *const _ as usize },
        2200usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(opc)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).opc2 as *const _ as usize },
        2208usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(opc2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).opcode as *const _ as usize },
        2216usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(opcode)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).opcode2 as *const _ as usize },
        2224usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(opcode2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).operand as *const _ as usize },
        2232usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(operand)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).operation_ as *const _ as usize },
        2240usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(operation_)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).opt as *const _ as usize },
        2248usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(opt)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).option as *const _ as usize },
        2256usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(option)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).osize as *const _ as usize },
        2264usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(osize)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).pac as *const _ as usize },
        2272usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(pac)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).page as *const _ as usize },
        2280usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(page)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).pair as *const _ as usize },
        2288usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(pair)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).pairs as *const _ as usize },
        2296usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(pairs)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).part as *const _ as usize },
        2304usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(part)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).part1 as *const _ as usize },
        2312usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(part1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).pat as *const _ as usize },
        2320usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(pat)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).pattern as *const _ as usize },
        2328usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(pattern)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).poly as *const _ as usize },
        2336usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(poly)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).pos as *const _ as usize },
        2344usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).position as *const _ as usize },
        2352usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(position)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).postindex as *const _ as usize },
        2360usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(postindex)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).pref_hint as *const _ as usize },
        2368usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(pref_hint)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).prfop as *const _ as usize },
        2376usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(prfop)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).ptype as *const _ as usize },
        2384usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(ptype)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).rd as *const _ as usize },
        2392usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(rd)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).read as *const _ as usize },
        2400usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(read)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).regs as *const _ as usize },
        2408usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(regs)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).regsize as *const _ as usize },
        2416usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(regsize)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).replicate as *const _ as usize },
        2424usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(replicate)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).rmode as *const _ as usize },
        2432usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(rmode)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).rot as *const _ as usize },
        2440usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(rot)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).round as *const _ as usize },
        2448usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(round)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).rounding as *const _ as usize },
        2456usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(rounding)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).rpt as *const _ as usize },
        2464usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(rpt)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).rsize as *const _ as usize },
        2472usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(rsize)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).rn_unknown as *const _ as usize },
        2480usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(rn_unknown)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).rt_unknown as *const _ as usize },
        2488usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(rt_unknown)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).rw as *const _ as usize },
        2496usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(rw)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).s as *const _ as usize },
        2504usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(s)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).s_esize as *const _ as usize },
        2512usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(s_esize)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).saturating as *const _ as usize },
        2520usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(saturating)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).scale as *const _ as usize },
        2528usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(scale)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).sel as *const _ as usize },
        2536usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(sel)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).sel_a as *const _ as usize },
        2544usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(sel_a)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).sel_b as *const _ as usize },
        2552usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(sel_b)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).selem as *const _ as usize },
        2560usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(selem)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).setflags as *const _ as usize },
        2568usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(setflags)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).sf as *const _ as usize },
        2576usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(sf)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).sh as *const _ as usize },
        2584usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(sh)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).shift as *const _ as usize },
        2592usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(shift)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).shift_amount as *const _ as usize },
        2600usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(shift_amount)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).shift_type as *const _ as usize },
        2608usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(shift_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).signal_all_nans as *const _ as usize },
        2616usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(signal_all_nans)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).signed_ as *const _ as usize },
        2624usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(signed_)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).simm7 as *const _ as usize },
        2632usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(simm7)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).size as *const _ as usize },
        2640usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).source_is_sp as *const _ as usize },
        2648usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(source_is_sp)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).src_index as *const _ as usize },
        2656usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(src_index)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).src_unsigned as *const _ as usize },
        2664usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(src_unsigned)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).srcsize as *const _ as usize },
        2672usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(srcsize)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).ssize as *const _ as usize },
        2680usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(ssize)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).ssz as *const _ as usize },
        2688usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(ssz)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).stacctype as *const _ as usize },
        2696usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(stacctype)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).stream as *const _ as usize },
        2704usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(stream)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).sub_i as *const _ as usize },
        2712usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(sub_i)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).sub_op as *const _ as usize },
        2720usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(sub_op)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).sub_r as *const _ as usize },
        2728usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(sub_r)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).swsize as *const _ as usize },
        2736usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(swsize)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).sys_crm as *const _ as usize },
        2744usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(sys_crm)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).sys_crn as *const _ as usize },
        2752usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(sys_crn)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).sys_op0 as *const _ as usize },
        2760usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(sys_op0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).sys_op1 as *const _ as usize },
        2768usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(sys_op1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).sys_op2 as *const _ as usize },
        2776usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(sys_op2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).sz as *const _ as usize },
        2784usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(sz)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).t as *const _ as usize },
        2792usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(t)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).t2 as *const _ as usize },
        2800usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(t2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).tb as *const _ as usize },
        2808usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(tb)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).tag_checked as *const _ as usize },
        2816usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(tag_checked)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).tag_offset as *const _ as usize },
        2824usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(tag_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).target_level as *const _ as usize },
        2832usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(target_level)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).tmask as *const _ as usize },
        2840usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(tmask)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).tsize as *const _ as usize },
        2848usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(tsize)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).tsz as *const _ as usize },
        2856usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(tsz)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).tszh as *const _ as usize },
        2864usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(tszh)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).tszl as *const _ as usize },
        2872usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(tszl)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).types as *const _ as usize },
        2880usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(types)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).uimm4 as *const _ as usize },
        2888usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(uimm4)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).uimm6 as *const _ as usize },
        2896usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(uimm6)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).unpriv_at_el1 as *const _ as usize },
        2904usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(unpriv_at_el1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).unpriv_at_el2 as *const _ as usize },
        2912usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(unpriv_at_el2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).uns as *const _ as usize },
        2920usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(uns)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).unsigned_ as *const _ as usize },
        2928usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(unsigned_)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).use_key_a as *const _ as usize },
        2936usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(use_key_a)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).user_access_override as *const _ as usize },
        2944usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(user_access_override)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).wback as *const _ as usize },
        2952usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(wback)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).wb_unknown as *const _ as usize },
        2960usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(wb_unknown)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).wmask as *const _ as usize },
        2968usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(wmask)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).writeback as *const _ as usize },
        2976usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(writeback)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).xs as *const _ as usize },
        2984usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(xs)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).Zk as *const _ as usize },
        2992usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(Zk)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<context_>())).zero_data as *const _ as usize },
        3000usize,
        concat!(
            "Offset of field: ",
            stringify!(context_),
            "::",
            stringify!(zero_data)
        )
    );
}
pub type context = context_;
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OperandClass {
    NONE = 0,
    IMM32 = 1,
    IMM64 = 2,
    FIMM32 = 3,
    STR_IMM = 4,
    REG = 5,
    MULTI_REG = 6,
    SYS_REG = 7,
    MEM_REG = 8,
    MEM_PRE_IDX = 9,
    MEM_POST_IDX = 10,
    MEM_OFFSET = 11,
    MEM_EXTENDED = 12,
    LABEL = 13,
    CONDITION = 14,
    NAME = 15,
    IMPLEMENTATION_SPECIFIC = 16,
}
pub const Condition_COND_EQ: Condition = 0;
pub const Condition_COND_NE: Condition = 1;
pub const Condition_COND_CS: Condition = 2;
pub const Condition_COND_CC: Condition = 3;
pub const Condition_COND_MI: Condition = 4;
pub const Condition_COND_PL: Condition = 5;
pub const Condition_COND_VS: Condition = 6;
pub const Condition_COND_VC: Condition = 7;
pub const Condition_COND_HI: Condition = 8;
pub const Condition_COND_LS: Condition = 9;
pub const Condition_COND_GE: Condition = 10;
pub const Condition_COND_LT: Condition = 11;
pub const Condition_COND_GT: Condition = 12;
pub const Condition_COND_LE: Condition = 13;
pub const Condition_COND_AL: Condition = 14;
pub const Condition_COND_NV: Condition = 15;
pub const Condition_END_CONDITION: Condition = 16;
pub type Condition = ::std::os::raw::c_int;
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ShiftType {
    ShiftType_NONE = 0,
    ShiftType_LSL = 1,
    ShiftType_LSR = 2,
    ShiftType_ASR = 3,
    ShiftType_ROR = 4,
    ShiftType_UXTW = 5,
    ShiftType_SXTW = 6,
    ShiftType_SXTX = 7,
    ShiftType_UXTX = 8,
    ShiftType_SXTB = 9,
    ShiftType_SXTH = 10,
    ShiftType_UXTH = 11,
    ShiftType_UXTB = 12,
    ShiftType_MSL = 13,
    ShiftType_END = 14,
}
pub const Group_GROUP_UNALLOCATED: Group = 0;
pub const Group_GROUP_DATA_PROCESSING_IMM: Group = 1;
pub const Group_GROUP_BRANCH_EXCEPTION_SYSTEM: Group = 2;
pub const Group_GROUP_LOAD_STORE: Group = 3;
pub const Group_GROUP_DATA_PROCESSING_REG: Group = 4;
pub const Group_GROUP_DATA_PROCESSING_SIMD: Group = 5;
pub const Group_GROUP_DATA_PROCESSING_SIMD2: Group = 6;
pub const Group_END_GROUP: Group = 7;
pub type Group = ::std::os::raw::c_int;
#[repr(C)]
pub struct InstructionOperand {
    pub operandClass: OperandClass,
    pub arrSpec: ArrangementSpec,
    pub reg: [Register; 5usize],
    pub cond: Condition,
    pub implspec: [u8; 5usize],
    pub sysreg: SystemReg,
    pub laneUsed: bool,
    pub lane: u32,
    pub immediate: u64,
    pub shiftType: ShiftType,
    pub shiftValueUsed: bool,
    pub shiftValue: u32,
    pub extend: ShiftType,
    pub signedImm: bool,
    pub pred_qual: ::std::os::raw::c_char,
    pub mul_vl: bool,
    pub name: [::std::os::raw::c_char; 16usize],
}
#[test]
fn bindgen_test_layout_InstructionOperand() {
    assert_eq!(
        ::core::mem::size_of::<InstructionOperand>(),
        104usize,
        concat!("Size of: ", stringify!(InstructionOperand))
    );
    assert_eq!(
        ::core::mem::align_of::<InstructionOperand>(),
        8usize,
        concat!("Alignment of ", stringify!(InstructionOperand))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<InstructionOperand>())).operandClass as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(InstructionOperand),
            "::",
            stringify!(operandClass)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<InstructionOperand>())).arrSpec as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(InstructionOperand),
            "::",
            stringify!(arrSpec)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<InstructionOperand>())).reg as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(InstructionOperand),
            "::",
            stringify!(reg)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<InstructionOperand>())).cond as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(InstructionOperand),
            "::",
            stringify!(cond)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<InstructionOperand>())).implspec as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(InstructionOperand),
            "::",
            stringify!(implspec)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<InstructionOperand>())).sysreg as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(InstructionOperand),
            "::",
            stringify!(sysreg)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<InstructionOperand>())).laneUsed as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(InstructionOperand),
            "::",
            stringify!(laneUsed)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<InstructionOperand>())).lane as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(InstructionOperand),
            "::",
            stringify!(lane)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<InstructionOperand>())).immediate as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(InstructionOperand),
            "::",
            stringify!(immediate)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<InstructionOperand>())).shiftType as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(InstructionOperand),
            "::",
            stringify!(shiftType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<InstructionOperand>())).shiftValueUsed as *const _ as usize
        },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(InstructionOperand),
            "::",
            stringify!(shiftValueUsed)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<InstructionOperand>())).shiftValue as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(InstructionOperand),
            "::",
            stringify!(shiftValue)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<InstructionOperand>())).extend as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(InstructionOperand),
            "::",
            stringify!(extend)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<InstructionOperand>())).signedImm as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(InstructionOperand),
            "::",
            stringify!(signedImm)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<InstructionOperand>())).pred_qual as *const _ as usize },
        81usize,
        concat!(
            "Offset of field: ",
            stringify!(InstructionOperand),
            "::",
            stringify!(pred_qual)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<InstructionOperand>())).mul_vl as *const _ as usize },
        82usize,
        concat!(
            "Offset of field: ",
            stringify!(InstructionOperand),
            "::",
            stringify!(mul_vl)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<InstructionOperand>())).name as *const _ as usize },
        83usize,
        concat!(
            "Offset of field: ",
            stringify!(InstructionOperand),
            "::",
            stringify!(name)
        )
    );
}
#[repr(C)]
pub struct Instruction {
    pub insword: u32,
    pub encoding: ENCODING,
    pub operation: Operation,
    pub operands: [InstructionOperand; 5usize],
    pub setflags: bool,
}
#[test]
fn bindgen_test_layout_Instruction() {
    assert_eq!(
        ::core::mem::size_of::<Instruction>(),
        544usize,
        concat!("Size of: ", stringify!(Instruction))
    );
    assert_eq!(
        ::core::mem::align_of::<Instruction>(),
        8usize,
        concat!("Alignment of ", stringify!(Instruction))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Instruction>())).insword as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Instruction),
            "::",
            stringify!(insword)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Instruction>())).encoding as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Instruction),
            "::",
            stringify!(encoding)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Instruction>())).operation as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Instruction),
            "::",
            stringify!(operation)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Instruction>())).operands as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Instruction),
            "::",
            stringify!(operands)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<Instruction>())).setflags as *const _ as usize },
        536usize,
        concat!(
            "Offset of field: ",
            stringify!(Instruction),
            "::",
            stringify!(setflags)
        )
    );
}
extern "C" {
    pub fn aarch64_decompose(
        instructionValue: u32,
        instr: *mut Instruction,
        address: u64,
    ) -> ::std::os::raw::c_int;
}
